Repository: cadany/HoverWord
Catalog: Resources/Localizable.xcstrings
Source language: en
Languages: zh_hans

# appearance.bgColor
source: Background Color
zh_hans: 背景色

# appearance.bgText
source: Background & Text
zh_hans: 背景与文字

# appearance.font
source: Font
zh_hans: 字体

# appearance.fontSize
source: Font Size
zh_hans: 字号

# appearance.meaningStyle
source: Meaning Style
zh_hans: 释义样式

# appearance.displayMode
source: Display Mode
zh_hans: 显示模式

# appearance.displayMode.always
source: Always
zh_hans: 总是显示

# appearance.displayMode.hover
source: On Hover
zh_hans: 悬停显示

# appearance.displayMode.hidden
source: Hidden
zh_hans: 隐藏

# appearance.phoneticStyle
source: Phonetic Style
zh_hans: 注音样式

# appearance.opacity
source: Opacity
zh_hans: 透明度

# appearance.preset
source: Preset Themes
zh_hans: 预设主题

# appearance.textColor
source: Text Color
zh_hans: 文字颜色

# appearance.theme
source: Theme
zh_hans: 主题

# appearance.theme.dark
source: Dark
zh_hans: 深色

# appearance.theme.green
source: Eye-care Green
zh_hans: 护眼绿

# appearance.theme.light
source: Light
zh_hans: 浅色

# appearance.wordStyle
source: Word Style
zh_hans: 单词样式

# common.cancel
source: Cancel
zh_hans: 取消

# common.close
source: Close
zh_hans: 关闭

# common.create
source: Create
zh_hans: 创建

# common.ok
source: OK
zh_hans: 确定

# enum.playOrder.sequential
source: Sequential
zh_hans: 顺序播放

# enum.playOrder.shuffled
source: Shuffled
zh_hans: 随机播放

# enum.reciteMode.carousel
source: Carousel
zh_hans: 走马灯式刷词模式

# enum.reciteMode.memoryFeedback
source: Memory Feedback
zh_hans: 记忆反馈模式

# experience.parameters.title
source: Parameters
zh_hans: 动效参数

# experience.preview
source: Preview
zh_hans: 预览

# experience.preview.example.new.meaning
source: n. world
zh_hans: n. 世界

# experience.preview.example.old.meaning
source: int. hello
zh_hans: int. 你好

# experience.transition.title
source: Transition Effect
zh_hans: 单词切换动效

# float.button.know
source: Know It
zh_hans: 认识

# float.button.speak
source: Speak
zh_hans: 播报发音

# float.button.unknown
source: Still Learning
zh_hans: 不认识

# float.completed
source: All Done
zh_hans: 已学完

# float.menu.quit
source: Quit HoverWord
zh_hans: 退出程序

# float.menu.restart
source: Restart
zh_hans: 重新开始

# float.menu.settings
source: Open Settings
zh_hans: 打开设置

# general.language
source: UI Language
zh_hans: 界面语言

# general.language.system
source: Follow System
zh_hans: 跟随系统

# import.error.empty
source: The file is empty
zh_hans: 文件内容为空

# import.error.encoding
source: Invalid file: not UTF-8 encoded
zh_hans: 文件格式错误：非 UTF-8 编码

# import.error.fields
source: Not enough fields (at least 4 required)
zh_hans: 字段数量不足（至少需要 4 个字段）

# import.error.line.format
source: Format error on line %d: %@
zh_hans: 第 %d 行格式错误：%@

# import.error.meaning
source: Missing meaning 1 (field 4)
zh_hans: 缺少释义 1（第 4 字段）

# import.error.word
source: Missing source word (field 1)
zh_hans: 缺少源语言词条（第 1 字段）

# import.error.wordbookMissing
source: Wordbook not found
zh_hans: 单词本不存在

# menu.appSettings
source: HoverWord Settings…
zh_hans: HoverWord 设置…

# preview.col.lineNumber
source: Line
zh_hans: 行号

# preview.col.meaning
source: Meaning
zh_hans: 释义

# preview.col.phonetic
source: Phonetic
zh_hans: 音标

# preview.col.pos
source: Part of Speech
zh_hans: 词性

# preview.meaning.editHint
source: Multiple meanings are separated by " / "; each group is "pos meaning", up to 3 groups
zh_hans: 多组释义用 " / " 分隔，每组格式为"词性 释义"，最多 3 组

# preview.col.word
source: Word
zh_hans: 单词

# preview.empty
source: No entries in this wordbook
zh_hans: 该单词本暂无词条

# preview.page.format
source: Page %d of %d
zh_hans: 第 %d / %d 页

# preview.title.format
source: Entries — %@
zh_hans: 词条预览 — %@

# preview.total.format
source: %d entries in total
zh_hans: 共 %d 条

# recite.carouselLoops
source: Carousel Loops
zh_hans: 走马灯循环轮次

# recite.fullscreenHide
source: Hide floating window when a fullscreen app is active
zh_hans: 全屏应用时自动隐藏悬浮窗

# recite.muteInFullscreen
source: Mute speech while hidden in fullscreen
zh_hans: 全屏隐藏时静音发音

source: Recite Mode
zh_hans: 背记模式

# recite.other
source: Other
zh_hans: 其他

# recite.playOrder
source: Play Order
zh_hans: 展示顺序

# recite.seconds.format
source: %d s
zh_hans: %d 秒

# recite.section
source: Section Settings
zh_hans: Section 设置

# recite.sectionSize
source: Words per Section
zh_hans: 每组词数

# recite.stayDuration
source: Stay Duration
zh_hans: 单单词停留时长

# settings.title
source: HoverWord Settings
zh_hans: HoverWord 设置

# settings.transition.category.immersive
source: Immersive
zh_hans: 沉浸

# settings.transition.category.minimal
source: Minimal
zh_hans: 简约

# settings.transition.category.playful
source: Playful
zh_hans: 趣味

# settings.transition.effect.black-hole
source: Black Hole
zh_hans: 星体黑洞

# settings.transition.effect.bounce-in
source: Bounce In
zh_hans: 弹跳入场

# settings.transition.effect.card-flip
source: Card Flip
zh_hans: 卡片翻转

# settings.transition.effect.classic-fade
source: Classic Fade
zh_hans: 经典淡入

# settings.transition.effect.letter-morph
source: Letter Morph
zh_hans: 字母变形

# settings.transition.effect.liquid-merge
source: Liquid Merge
zh_hans: 液体融合

# settings.transition.effect.page-flip
source: Page Flip
zh_hans: 翻页效果

# settings.transition.effect.typewriter
source: Typewriter
zh_hans: 打字机

# settings.transition.parameter.duration
source: Flip Duration
zh_hans: 翻转时长

# settings.transition.parameter.intensity
source: Bounce Intensity
zh_hans: 弹性强度

# settings.transition.parameter.interval
source: Typing Interval
zh_hans: 字符间隔

# sidebar.appearance
source: Appearance
zh_hans: 外观

# sidebar.experience
source: Experience
zh_hans: 体验

# sidebar.general
source: General
zh_hans: 通用

# sidebar.recite
source: Recite
zh_hans: 背记

# sidebar.speech
source: Speech
zh_hans: 发音

# sidebar.wordbook
source: Wordbook
zh_hans: 单词本

# speech.accent
source: Accent
zh_hans: 发音口音

# speech.accent.en-AU
source: Australian
zh_hans: 澳大利亚

# speech.accent.en-CA
source: Canadian
zh_hans: 加拿大

# speech.accent.en-GB
source: British
zh_hans: 英式

# speech.accent.en-IE
source: Irish
zh_hans: 爱尔兰

# speech.accent.en-IN
source: Indian
zh_hans: 印度

# speech.accent.en-US
source: American
zh_hans: 美式

# speech.accent.en-ZA
source: South African
zh_hans: 南非

# speech.advanced
source: Advanced: choose a specific voice
zh_hans: 高级：选择具体语音

# speech.advanced.format
source: Advanced · Current voice: %@
zh_hans: 高级 · 当前语音：%@

# speech.autoPlay
source: Auto-play pronunciation on word switch
zh_hans: 切换单词时自动播放发音

# speech.footer
source: Powered by the system speech engine, works offline
zh_hans: 发音基于系统语音引擎，离线可用

# speech.language.en
source: English
zh_hans: 英语 (English)

source: Speech Rate
zh_hans: 语速

# speech.title
source: Speech
zh_hans: 发音设置

# speech.voice
source: Voice
zh_hans: 语音

# speech.voice.empty
source: No voices available for this accent. Please download system voices in System Settings.
zh_hans: 该口音暂无可用语音，请在系统设置中下载。

# speech.voice.preview
source: Preview
zh_hans: 试听

# speech.voice.quality.enhanced
source: Enhanced
zh_hans: 增强

# speech.voice.quality.premium
source: Premium
zh_hans: 高品质

# speech.voice.stop
source: Stop
zh_hans: 停止

# speech.voice.unavailable
source: Selected voice is unavailable, fell back to system default
zh_hans: 所选语音不可用，已回退系统默认

# wordbook.badge.system
source: System
zh_hans: 系统

# wordbook.delete.confirm.message
source: Are you sure you want to delete "%@"? It contains %d words. This cannot be undone.
zh_hans: 确定要删除“%@”吗？包含 %d 个单词，此操作不可恢复。

# wordbook.delete.confirm.title
source: Delete Wordbook
zh_hans: 删除单词本

# wordbook.error.notFound
source: Target wordbook not found
zh_hans: 找不到目标单词本

# wordbook.export.failed
source: Export Failed
zh_hans: 导出失败

# wordbook.favorites.enableHint
source: Collect some words before enabling
zh_hans: 请先收藏单词后再启用

# wordbook.favorites.name
source: Favorites
zh_hans: 我的收藏

# wordbook.import.failed
source: Import Failed
zh_hans: 导入失败

# wordbook.language.autodetect
source: Auto Detect
zh_hans: 自动检测

# wordbook.language.source
source: Source Language
zh_hans: 源语言

# wordbook.language.target
source: Target Language
zh_hans: 目标语言

# wordbook.language.title
source: Language Pair
zh_hans: 语言对

# wordbook.menu.language
source: Language…
zh_hans: 语言…

# wordbook.meta.format
source: %d words · %d Sections
zh_hans: %d 词 · %d Section

# wordbook.new.placeholder
source: Name
zh_hans: 名称

# wordbook.new.title
source: New Wordbook
zh_hans: 新建单词本

# wordbook.rename.placeholder
source: New Name
zh_hans: 新名称

# wordbook.rename.title
source: Rename Wordbook
zh_hans: 重命名单词本

# wordbook.toolbar.export
source: Export
zh_hans: 导出

# wordbook.toolbar.delete
source: Delete
zh_hans: 删除

# wordbook.toolbar.import
source: Import…
zh_hans: 导入…

# wordbook.toolbar.new
source: New
zh_hans: 新建

# wordbook.toolbar.preview
source: Preview
zh_hans: 预览

# wordbook.toolbar.rename
source: Rename
zh_hans: 重命名
